# Importando Nomes (API IBGE)

In [1]:
# API - Ranking de Nomes do IBGE
# https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking

In [2]:
# filtrando qtd de linhas = 20 e sexo feminino
# https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=20&sexo=f

In [3]:
import pandas as pd

In [9]:
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')

In [10]:
print("Quantidade de nomes: " + str(len(nomes_m) + len(nomes_f)))

Quantidade de nomes: 400

In [11]:
# Concatenando nomes masculinos e femininos

In [12]:
frames = [nomes_f, nomes_m]

In [13]:
frames

[          nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns],
           nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns]]

In [14]:
# Concatenando apenas os nomes dentro de um DataFrame
nomes = pd.concat(frames)['nome'].to_frame()

In [15]:
#exibindo um amostra de 5 nomes
nomes.sample(5)

        nome
52    SAMUEL
135   RUBENS
128  EDVALDO
191    ERICK
79    MONICA

# Incluindo ID dos alunos

In [16]:
import numpy as np
np.random.seed(123)

In [17]:
total_alunos = len(nomes)
total_alunos

400

In [18]:
# nova coluna com IDs aleatórios para os alunos
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1

In [19]:
nomes

          nome  id_aluno
0        MARIA       235
1          ANA        43
2    FRANCISCA       304
3      ANTONIA       156
4      ADRIANA       343
..         ...       ...
195     WALTER       231
196    ARLINDO        99
197    MICHAEL       323
198     ALVARO       383
199    GEOVANE       366

[400 rows x 2 columns]

In [25]:
# atribuindo o dominio de e-mail para os alunos (2 dominios disponíveis)
dominios = ['@dominiodoemail.com.br', '@servicoemail.com']
nomes['dominio'] =  np.random.choice(dominios, total_alunos)   #escolhe entre os 2 dominios aleatóriamente

In [21]:
nomes.sample(5)

        nome  id_aluno                 dominio
46   FABIANA       358        servicoemail.com
38     DIEGO       294  @dominiodoemail.com.br
136   NILTON       271  @dominiodoemail.com.br
119   MOISES         4        servicoemail.com
101   GISELE       298        servicoemail.com

In [34]:
# cria novo campo contendo o e-mail, todo em minúsculo
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [35]:
nomes.sample(5)

        nome  id_aluno                 dominio                          email
199  GEOVANE       366  @dominiodoemail.com.br  geovane@dominiodoemail.com.br
14   JESSICA       185       @servicoemail.com       jessica@servicoemail.com
102    HELIO       117  @dominiodoemail.com.br    helio@dominiodoemail.com.br
194    CLARA       277  @dominiodoemail.com.br    clara@dominiodoemail.com.br
149   ISRAEL        65  @dominiodoemail.com.br   israel@dominiodoemail.com.br